//#define _CRT_SECURE_NO_WARNINGS
//#include <stdio.h>
//
////int main(){
////	int a = 10;	
////	float f = 10.0;
////	return 0;
////}
//
//void model(int a);
//int main()
//{
//	// 整数在内存中用补码形式进行处理
//	int a = 20;
//	// 00000000 00000000 00000000 00010100	原码=补码=反码
//	//		00				00				00					14
//
//	int b = -20;
//	// 10000000 00000000 00000000 00010100	原码
//	// 11111111 11111111 11111111 11101011	反码
//	// 11111111 11111111 11111111 11101100 补码
//	//		ff				ff					ff				ec
//
//	/* 判断当前机器的存储模式*/
//	model(a);
//
//	return 0;
//}
//
//void model(int a) {
//	//char 类型的指针能操作的数据只有1字节
//	char* pc = (char*)&a;
//	if (*pc == a) {
//		printf("小端模式\n");
//	}
//	else {
//		printf("大端模式\n");
//	}
//} 
//
